//
//	CEnemy.cpp
//		Author:HIROMASA IKEDA	DATE:2018/10/19
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

//===============================================
//	インクルード	include
//===============================================
#include"common.h"
#include<d3dx9.h>
#include<vector>

//class
#include"CEnemy.h"

//===============================================
//	マクロ定義		define
//===============================================


//===============================================
//	グローバル変数	global
//===============================================
vector<BodyObject*> pBody_Index;

//===============================================
//	Enemy		class
//===============================================

//-------------------------------------
//	コンストラクタ
//-------------------------------------
Enemy::Enemy(Transform* pTransform,Texture* pTexture):GameObject(pTransform,pTexture)
{

}

//------------------------------------
//	デストラクタ
//------------------------------------
Enemy::~Enemy()
{

}

//------------------------------------
//	Bodyを設定
//------------------------------------
void Enemy::Add_Body(BodyObject* pBodyObject)
{
	pBodyObject->Set_Parent(this);
	pBody_Index.push_back(pBodyObject);
}



